**How do I rename columns in a pandas DataFrame?**

In [1]:
import pandas as pd

**Read Dataset**

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

**Method:**1

In [5]:
ufo.rename(columns={'Colors Reported':'Colors_Reported', 
                    'Shape Reported': 'Shape_ Reported'}, inplace=True)
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_ Reported', 'State', 'Time'], dtype='object')

**Method:**2

In [6]:
ufo_cols = ['city', 'colors_reported', 'shape_ reported', 'state', 'time']
ufo.columns = ufo_cols
ufo.head()

                   city colors_reported shape_ reported state             time
0                Ithaca             NaN        TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN           OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN            OVAL    CO  2/15/1931 14:00
3               Abilene             NaN            DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN           LIGHT    NY  4/18/1933 19:00

**Method:**3

In [7]:
ufo = pd.read_csv('http://bit.ly/uforeports',names=ufo_cols, header=0) # will overrite

In [8]:
ufo.head()

                   city colors_reported shape_ reported state             time
0                Ithaca             NaN        TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN           OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN            OVAL    CO  2/15/1931 14:00
3               Abilene             NaN            DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN           LIGHT    NY  4/18/1933 19:00

**Replace columns spaces into under_score**

In [11]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [12]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [13]:
ufo.columns = ufo.columns.str.replace(' ','_')
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')